{"date": "2025-12-06", "timestamp": "2025-12-06T12:00:00", "type": "esej", "title": "Vznik USA: Od Kolumba po Nixona", "content": "1. vznik usa, ako experiment slobody\nAmeriku objavili v roku cca v roku 1500\n- na uzemi ameriky v tedy už žili indiani, ako povodny obyvatelia, ktorý tam prišli velmi dávno, ešte ked bola amerika spojena z ruskom, pocas doby ladovej. Čize ked tam kolumbus doktivol, mysliac si ze dosiel do Indie, pomenoval tamojších ludi ako indianov. \nKrištof kolumbus, ako objavitel a moreplavec, bol povodom zo španelska, a tak španeli začali podnikať vypravy do ameriky, lebo sa tam našli doteraz neznáme civilizacie ako Aztékovia alebo Mayovia. Tie civilizacie nepoznali peniaze, tak ako europania, a zlato kotreho mali neskutocne vela, lebo ho neminali na obchod, pouzivali na \"dláždenie ulíc\" a dekorácie chrámov, alebo na šperky. \nPre europanov a konkretne španelov, to bol zlatý dol. Prvých cca 150 rokov sa do ameriky chodilo obchodovať z aztekmi, učiť ich krestanstvo a vzdelavat ich europskej kulture. \nEuropania, si totižto mysleli, že oni ako civilizacia su omnoho vyspelejsi, lebo maju komplexnejsi ekonomicky alebo politicky system, a preto su aztekovia alebo indiani, evolučne menej rozvinuty a preto je dobry napad aby sa europa pokusila o to aby do podovnej amrieky priniesli pismo, krestanstvo, peniaze.. skoncilo to tak, ze jak dosli europania za aztekmi, tak tak sa zrazu medzi nimi zacali vyskytovat pre auropu bezne ochorenia.. osýpky, chrípka.. bakterie a virusy, na ktore boli europania zvyknuty ale \"americania\" sa s nimi nikdy nestretli, cize v priebehu 100 rokov, tie civilizacie vyhynuli, z velkej casti kvoli tymto ochoreniam. \n\niba 2 roky po objaveni noveho kontinentu a bohatých civilizacii Mayov a Aztekov, si Ameriku rozdelili medzi sebou španelsko a portugalsko. doslova sa medzi sebou dohodli, kotre uzemie bude komu patrit, hoci na to nikdy nemali nárok. \n\naztekovia a mayovia teda kompletne padli bez vacsich bojov, iba v dosledku ochoreni na ktore nemali imunitu. \npre europu to bola jasna odpoved na to co potrebovali.. nove uzemia, vela vela zlata, krestanstke misie a postupne osidlovanie. \nv tom čase bolo v europe vela bohatych rodin, ktore mali na starosti velke uzemia, ktore sa tazko rozsirovali, lebo kazdy mal nejakeho agresivneho suseda.. europske staty v tedy este neexistovlai ako dnes, cize kolumbus hoci bol talian ale plavil sa na španelskej lodi za španelske peniaze, a ked sa kral rozhodol ze chce viac majetku alebo moci, tak by bola cesta vojensky napadnut susednu krajinu, ale to ich omrzelo po stovkach rokov vojen.. cize ak sa za oceanom nasla neobjavena zem, plna bohatstva a kulturuy, ktora sa nebrani a ak sa brani tak derevenymi palicami, ktore proti gulometu a vojenskym strategiam nemaju najmensiu sancu. \nkralom sa rozvietili vsetky kontrolky, a tí ktorý mali rozvinutú lodné technologie tak hned vyrazili na toto dobrodruzstvo za bohatsvom a slávou, ktorú objavitelia ako kolumbus a jemu podobny donášali pre svojho krala ktory im ešte aj zaplatil, k tomu co vedeli ziskat v amerike.. \nvtedy sa napriklad do europy zacali dostavat  zemiaky, rajčiny, kukuricu, kakao, tabak, vanilku či papriku, to vsetko a este viac europa nepoznala cize automaticky sa z toho stal velmi dolezity artikel, pretoze v Peru sa také zemiaky pestovali tisice rokov. Pre auropanov to bolo nove a preto zaujimave. Rajčinám europania spočiatku neverili kvoli vyraznej červenej farbe, a pestovali sa skor ako okrasne rastliny a dekoracie. Zemiaky na druhu stranu, vyrazne prispeli k nárastu obyvatelov, lebo to bola polná plodina ktora sa dala jednoducho pestovat a dalo sa nou nakrmit ovela viac ludi ako z tvrdeho psenicneho chleba alebo draheho masa, cize v europe malo viac ludi viac jedla, cize nasral počet obyvatelov. \nVšetko toto, hoci to bolo extremne nefer voci povodnym americanom, europania mali ohromnu radost, pretoze to vnimali ako dokaz dvojej nadradenosti voci \"novemu svetu\", ktorý môžu začať teraz osidlovať, vzdelavat (ak je ešte koho) a zotročovať. \n\ntoto je objavenie ameriky.. hned ako bol objavena tak za par rokov (cca 150) bola kompletne zdecimovana, povrazdena, a rozkradnuta. toto boli roky od 1500 do 1600 cca. \n\ndomorodci na severnej strane ameriky, dnesné USA, to mali uplne rovnako. \npretoze od roku cca 1600, sa zacala objavovat a osidlovat severna amerika. \npocas dalsich 100 rokov, do roku cca 1700, si toto uzemie kompletne podmanili angličania, francuzi, holandania. tí prišli na uzemie ameriky a zalozili tam pristavy. \npre europanov, to znamenalo, priamu obchodnu cestu k bohatstvu ktore v europe nemali.. kožušan bizonov a inych zvierat, cukrova trstina, tabak (vtedy sa ním dalo platit). \nFungovalo to tak, ze ze naprikald new amsterdam bol povodne zalozeny holandanmi, neskor obsadeny anglicanmi a premenovany na new york. cize ten kto to mal \"obsadene\" tak kontroloval kto moze dostat kolko uzemia, ktore sa kupovalo za peniaze, a na tom uzemi potom dany clvoek mohol pestovat plodiny a zvierata a predavat ich domov do europy.. cize kazdy kto sa necitil dobre v europe, a mal peniaze na to aby si kupil lod, tak zobral svoju rodinu a blizkych a isiel do noveho slobodneho sveta, v ktorom nemaju taky silny dosah artistokraticke, kralovske vrstvy ktore sa k obsanom spravali lahostajne. \nak boli nejaky nabozensky zalozene rodiny, ktore boli nepohodlne pre katolicku cirkev alebo krala, tak utiekli do ameriky a tak sirili svoje nabozenstva (preto je v amerike tolko roznych krestanstiev a vsetky su ovela viac mimo, oproti tým europskym). \nLenze poda, ktoru bristky uradnik rozdeloval medzi majetnych pristahovalcov, niekomu patrila, pretoze amerika je plna riek a urodnej pody a priazniveho podnebia, cize na tych najurodnejsich meistach, ktore chceli aj europania žili predsa indiani už stovky rokov.. indiani sa vzburili, ale europania ich proste vyzabilaji, alebo vystahovali.. alebo si z nich spravili otrokov. \notroctvo a povodna amerika su uzko spate, pretoze potom, ako europania zistili ze zotrocit cudzi narod neni az take tazke, tak euroap zacala rovnakym sposobom terorizovat afiku, z ktorej si bohatí europania dovazali černochov, ktorý im potom pracovali na kakaovych ci tabakovych plantážach, za ktore potom ameriky europania zarabali penaize na obchode zo starou europou. \ntak sa černoši dostali do ameriky, a tak sa inidiani z ameriky vyparili.. po indianoch zostalo len zopar oproti povodnemu poctu. \n\npresuvame sa k rokom okolo 1800, kedy uz v amerike zilo niekolko generacii europanov. poda v amerike bola velmi lacna, a zrazu bolo vela dedičov tychto uzemi, cize osidlovanie nebol problem.. francuzki, britski a holandski králi rozhodovali o tom, kto bude vlastnikom akej velkej pody, čo americkym europanom zacalo vadit.. a tak sa vzburili proti europskej vláde, a tak sa zacala americká revolucia v roku 1776, čo sa povazuje aj za vznik USA. \nkonflikt, americkej revolucie spocival v tom, ze sa postupne vytvroili dve skupiny statov, ktorých bolo 13. jedny suhlasili s tym aby europa nadalej politicky aj ekonomicky kontrolovala diane v amerike, a druha skupina si to chcela menezovat a rozhodovat sama.. jedny chceli mat otrokov, a druhy chceli dat otrokom viac volnosti. \nkonflikt prebehol, amrika vyhlasila nezavislost, spojila sa do dvoch celkov - juh a sever a postupne sa amerika naplno osidlila az k zapadnemu pobreziu, kde neskor v Kalifornii objavili zlato a ropu. \n\nv amerike sa tak zacala budovat uplne nova civilizacia, ktora nebola zatazena europskymi vojnami, debilnymi nabozenstvami a kralovskymi poskokmi. amerika sa zacala industrializovat, zacala teda vyrabat veci zo zeleza, rozsiahle zeleznice, obchodne trasy, velke ropne podniky.. amerika začala byť hráčom, popri europe. \n\n2. 1900\nv tomto case sa v amerike stabilizovali obrovske celo-kontinentalne spolocnosti, ktore dominovali jednotlivym odvetiav na celom uzemi ameriky. \nv amerike vedeli vyrabat kvalitne zelezo a po celej amerike sa na roznych miestach vyrabali alebo pestovali rozne suroviny. tie mesta neboli prepojene, a vyriesili to zeleznice, ktore sa zacali budovat v extremnom rozsahu. zeleznice postavila jedna spolocnost, ropu dalsia (rockefeller), cize zoapr velmi mocnych ludi, kontorlovali cez obchodne cesty a cenu ropy, v podstate celu ekonomiku ameriky.. lebo ak spolocnsot povedala ze chcem take alebo onake dane aby ludia platili, tak im v tom nikto nezabranil. tieto bohate spolocnsoti sa potom angazovali v politike a na svojom zisku. \n\n3. svetova vojna\nAmerika sa tak stala velmi bohatou a velmi dobre organizovanou a pomerne ludnatou. ked zacala prva svetova vojna 1914, amerika ostala neutrálna, nezapojila sa do vojny, lebo sa jej v podstate netýkala, ale kedze mala rozvinuty a moderny primysel a vela penazi, tak amerika sponzorovala vojnu proti nemecku. Do vojny sa vsak ale zapojili, pretoze nemci hecovali mexiko proti usa, a ponorkami im znicili niekoko lodnych posadok, čo vyvolalo diplomaticky šok. \n1917 USA nemcom vyhlasilo vojnu, ako odpoved na provokáciu. \nAmeriku to výrazne urýchlilo vo svojom vývoji, pretoze uloha ameriky v tom case bola financne zásobovať krajiny ktore priamo bojovali proti nemcom, vyrabali pre nich zbrane, davali im požičky a teda neskor, pomahali aj vojensky. \nnakoniec amerika pomohla porazit nemecko, ale hlavne, amerika financovala velku cast vojny, cize briti, francuzi a ostatní si od ameriky napožičiavali peniaze, ktore sa postupne splácalai zlatom a tak sa stal new york miestom ktore poziciava najviac penazi a ma najvacsie zasoby zlata. \ntoto umoznilo amerike byt tak bohatou, pretoze ak je \"cely svet\" amerike dlzny, tak amerika urcuje tempo celej globalnej ekonomiky. \nvojna skoncila 1918 a najblizsich 10 rokov do roku 1929, amerika zazila extremny narast bohastva a technologii.. zacali vznikat autá, továrne s pásovou výrobou čo bolo dovtedy nepoznana vec, rádio, elektricka infrastruktura, banky.. amerika zazila zlaté časy. \n1929 však americká burza, ktorá drzala vacsinu penazi sveta, proste skrachovala, lebo sa trh otvoril aj beznym ludom, ktorým banky ponukali lacne peniaze, alcne pozicky. ked tychto poziciek bolo prilis vela, banky dvihli cenu tychto poziciek, ludia a firmy zacali z burzi stahovat vela penazi naraz a nastala hyperinflacia, obrovske prepustanie, prudky narast cien potravin, ropy a dalsich veci.. \nnajviac na toto doplacala europa, ktora bola zdevastovana po vojne, a kedze europske financne institucie boli naviazane na americku ekonomiku ktora sa vo velmi kratkom case prostre prepadla a dvihla ceny, v nemecku sa za chleba platilo miliardovími bankovkami ktore ludia nosili v táčkach. \nnemecko ako agresor vojny, bolo donutene platit štátom ktore napadli platit odškodne, na ktore nemali penaize a tak si muselo nemecko penaize pozicat a ked padla amerika burza tak nemecko padlo tiez, na este hlbsie dno, co dalo za vznik druhej svetovej vojne, lebo toho vyuzil hitler. \n\n2. svetova vojna \nsvet bol po páde burzi paralizovany, kedze vsetci mali americke peniaze.. zacali toho vyuzivat radikalne hnutia, ktore vedeli stiahnut obyvatelstvo na svoju stranu, lebo im slubovali lepsie zajtrajsky. najma v nemecku, ktore ako hrda krajina, utrpela potupujucu porazku a potupne splacanie odškodného pre napadnute krajiny, a tak hitler nemocom slubil navrt hrdosti, lebo za vsetko mohli zidia.. zacala sa vojna 1939, amerika ostala neutralna, zapajat sa nechcela. znova europe iba poziciavala peniaze, zbrane a ostatne suroviny. Ameriku vyprovokovali teraz japonci (spojenec nacistickeho nemecka), lebo im znicili namornu zakladnu pri hawai, a tak sa amerika zapojila do druhej svetovej vojny v roku 1941. amerika mala nastarosti nacisticke japonsko v pacifickom oceane, a vojensky vypomahali aj europanom.\nvdaka amerike, v koordinacii s britmi a sovietskym zvazom, sa podarilo porazit nemecko, a amerika posilnila svoju poziciu globalneho hraca, lebo sa opakoval podobny scenar ako v prvejsvetovej. \neuropa si pozicala o dmaeriky peniaze, ktore im potom splacala, mali najviac zlata a najmenej znicene uzemia. boli dominantnou demokratickou velmocou, ktorej znicena europa nemala ako konkurovat. Amricania mali atomovu bombu ktora definitivne ukoncila vojnu tak, ze vydesila cely svet.. ludia mali zrazu zbran, s ktorou vedia znicit naraz cele mesto, kludne aj cely stat.. mala to byt poistka, proti tomu, aby sa znova nastaroval globalny konflikt. lenze nedopadlo to dobre. \n\n3. studena vojna \n\ndosledky atomovej bomby asi nikto nepredpokladal, pretoze rusi, soviatsky zvaz, kzorý sa tvaril ako spojenec demokracie, tiez chcel mat atomovu bombu, pretoze po vojne rusko ostalo taktiež nezničené, a ekonomicky nastartovane po nedavnej revolucii nastartovanej leninom (1917) a jeho nastupca Stalin, ktorý viedol vojnu proti nemmecku v druhej svetovej, nechcel zaostavat za amerikou. svoietsky zvaz dostal svoju sféru v plivu v podobe zabratych uzemi, ktoré boli donutene prijat komunizmus a uzku spolupracu z Moskovou, a tak sa svet rozdelil na dve polovice.\nrozvinuty zapad (francuzko, nemecko, taliansko...) financovany americkymi peniazemi, a menej rozvinuty vychod (ceskoslovensko, polsko, bulharsko, chorvatsko, rumunsko...) ktorý amerikce peniaze prijat nemohol, avsak sovietsky zvaz do vychodnej europy neposyktoval štedre financne balilcky aby sa mohli obnovit ekonomiky statov. vsetko bolo kontrolovane a planovane z moskyvy, a komu sa to neapcilo vo vychodnej europe, tak bol proste zavrety do pracovneho tabora a uz sa z neho nevratil zivy, alebo bol inak zabity. \ntoto a dalsie okolnosti, doviedli svet do dalsej vojny, ktora sa teraz neviedla cez vojakov ale cez špionaž. \nSvoiestky zvaz dostal uzemia vyhdonej europy za to ze pomohol porazit nemecko, a mal zabranit tomu aby sa nemecko po treti krat postilo do vojny. Sovietky zvaz vsak zacal vies propagadu proti zapdnej europe a hlavne amerike, a komunizmus sa zacal sirit aj do demokratickej zapadnej europy, a dokonca aj do ameriky, cez spionov. \nbola to doba, kedy amerika a sovietsky zvaz robili vsetko preto aby obyvatelov presvedcili o nadradenosti svojej politiky nad tou druhou, snazili sa o to aby mali navrh v pocte jadrovych zbrani a ekonomickej prosperity. \namerika na to reagovala rozne, a jeden z dosledkom je aj tajna sluzba CIA, ktora mala za cial eliminovat komunisticke vplivy v amerike ale aj vo svete. \nsovietsky zvaz sa chcel rozsirovat do iranu, iraku a dalsich krajin a ameriak tomu chcela zabranit cez CIA. vznikali rozsiahle spinazne akcie, ktore mali za ciel zisitit infromcie o komunistickych aktivitach a zbrojeni a KGB (soviatska tajna sluzba) sa snazili o to iste avsak zo spinavsimi praktikami. CIA postupovala casto krat nad ramec zakona, hladali komunistov a spionov mucili ich a vydierali, podplacali zaujmove skupiny, ako prevencia proti komunizmu a vela roznych veci.. \nvyvrcholilo to v roku 1961, ked bol Kennedy prezident. CIA mala naplanovanu operaciu na zvrhnutie komunistickeho rezimu, ktory prijala kuba. Kuba je ostrov hned po floridou, a Fidel Castro ako prezident tohoto ostrova, bol podporovatelom sovietskeho zvazu, comu chcela CIA zabranit, ale Kennedymu sa to nezdalo a operaciu nepodpisal, c cim CIA ratala. Kennedy sa dostal do konfliktu s CIA, co bolo jeden z dovodo preco nebol oblubeny medzi elitami. \nOperacie CIA boli velmi drahe a narocne na planovanie, amerika si nemohla dovolit aby zasotavala za sovietskym vplivom. Keby sa to CIA podarilo, zvrhnut vládu Fidela Castra, sovietsky zvaz by to mohlo nahnevat a mohla by sa zacal dalsia vojna, teraz ale s atomovymi bombami. \nCIA mala naplnovane aj dalsie operacie ktore boli nad ramce zakona a kennedy podpisal zakony ktore tieto akcie a pravomoci CIA obmedzuju. \n\ncize. \nkennedy je prezident, svet je v studenej vojne, vsade je propaganda, strach a špionaze. raz ma nvrch soviatsky zvaz, raz amerika.. amerika je overall aj tak dominantnejsia, ale rusi hraju spinavo a zakerne. \namericke tajne sluzby robia vsetko preto aby udrzali svoju poziciu, na amerikom uzemi, ale aj v globalnom meritku. \namerika po druhej svetovej vojne ma obrovksy a moderny zbrojarensky priemysel, ekonomicku dominanciu, vojenske zakladne vsade po svete, a hlavne domokraciu ako protipol voci ruskemu komunizmu, ktora sa snazi rovnako pretlacit, ako americka demokracia. \namerika su \"tí dobry\" rusi su \"tí zly\" a pre rusko je to zase naopak. \nCIA organizuje statne prevraty v irane, kde je vela ropy ktoru chce amerika aj rusko, a organizuje dalsie operacie zamerane na potlacenie komunizmu a zachovanie mieru, co su take vznesene temy, ze sa da za to skryt hocijaky nekalí umysel. \nCIA a tajne sluzby sa teda staraju o to aby bola americka demokracia vo svete zachovana. je to bordel, do ktoreho prichadza Kennedy. \nšarmatny, velmi chytri politk, z politickej rodiny s velkym financnym krytim. Kennedyho otex bol tiez politik, kennedyho brat bol tiez politik.. vsetky Kennedy boli politici, bola to velka rodina, ktora sa snazila vystupovat ako \"ti dobry\". \nKennedy si verejnost ziskal svojou pripravenostou a komunikacnou sikovnostou voci svojim oponentom, a tak ked sa s touto tvarou dostal do prezidentskeho uradu, spolu s jeho ministrom, bratom Robom Kennedy, stal v opozicii, voci spinavym praktikam CIA a tajnych sluzieb ktore spolupracovali aj s mafiou alebo inymi korupcnymi a kriminalnymi entitami.. kennedy chcel vstko zastavait a postupne sa staval nepohodlnym, lebo hrubo narusil dávno naplanovane stabilizacne akcie a opatrenia. \nkennedy moc neveril tomu ze by rusko skutocne rozputalo globalnu jadrovu vojnu, a tak rozbehnute tajne projekty po celom svete proste spomalil. na to bolo naviazane ohromne mnozstvo prostriedkov, ludi a projektov a to sa nepacilo vplivnym ludom ktory financovali a zarabali na zbrojnom priemysle a nerastnych surovinach a dalsich surovin v cudzich statoch. \n\nKed chcela CIA obsadit Kubu a zabranit jej aby spolupracovala s rusmi, kennedy nariadil spomalenie zbrojenia a podpisuje dohodu o zastaveni vyrabani jadrovych zbrani, co bolo do vtedy nepredstavitelne, lebo to zo strany ruska mohlo posobit ako prilezitost na utok slabsieho.. \nzaujimava situacia bola vo vietname, kde priebehali komunisticke vplivy a vietnam sa rozdelil na severnu a juznu cast. sever komunisti, juh demokracia. \nkennedy bol v urade 1961-1963, kedy sa na ameriku tlacilo, aby okrem zasobovania a poradenstvu, demokratickemu vietnamu pomohla aj vojensky.. vietnam bol dolezity, pretoze sa tam nasačkovali komunisti podporovany Moskvou, a keby bol vietnam obsadeny, tak by to mohlo spustiti dalsie rozsirovanie ruska, co si amerika nechcela nechať dovolit. Pre ameriku bola tato vojna dalsi zarobok a stratene zivoty vojakov. \nkenedy mal iba 43 rokov, najmaldis prezident v dejinach.. bol to bohaty mlady clovek ktory sa nepozeral na svet skrze vojnu.. jeho motto bolo \"nepozeraj sa na to ako ti ma pomoct stat, ale na to ako by si ty mohol pomoct statu\", zastavala ukludnovanie sporov s ruskom a nie zvysovanie napatia. \ntoto sa ale mocnym ludom nepacilo, lebo na placiach ameriky stal cely ekonomicky svet, a pripadne spomalenie, mohol znamenat narast komunizmu, co neni vhodne pre amerika, ktorej vyhovuje ze si vsetci poziciavaju penaize od nej, a spoliehalu sa na americku bezpecnost nie na tu rusku.. \ncize ekd bol konflikt vo vietname, kennedy to zastavoval, ak bol komunizmus na Kube v blizkosti floridy, kennedy sa chcel dohodnut, nie utocit.. \namericka ekonomika mala velky profit z tych vojensky operacii, ekonomicky ich to stále vela penazi, ale image ktorý amerika mala bol omnoho dolezitejsi, lebo ak je amerika sueprvelmoc, neohroznea ruskom, tak si od usa budu nadalej vsetci poziciavat peniaze a budu mat kontrolu nad svetovou ekonomikou, co amerike prostre maximalne vyhovuje. \nKennedy, teda ako prezident zdedil tajne sluzby ktore organizovali statne prevraty po svete, spolupracovali s mafiou a korupciou, chceli rozpustat celoformátovu vojnu vo vietname a dalsie vnutopolicitke aktivity. \nkennedy proste nikomu nevyhovoval, do politiky prisiel ako mlady a neznamy, a vo volbach porazil Richarda Nixona, ktorý po Kennedyho smrti vyhral volby prezidenta. \n\nCIA mala v tom case ako tajna policia v amerike velmi silnu poziciu, ktoru kennedy proste ohrozil alebo spomalil, co viedlo k jeho vrazde. \n\ntajna policia sledovala obcanov, sledovala komunisticke akcie v zahranicny nelegalnymi praktikami, zaplietali sa do štátnych prevratov po svete.. kenedy tomu celemu nariadil stopku alebo zakonne regulacie, kennedy na to začal poukazovat a chcel stat ocistit, a mal naklonenu verejnost na svoju stranu.. po jeho smrti zacali vznikat konspiracne torie, pretoze objasnenie jeho smrti bolo nezmysluplne a verejnost tomu neverila. \n\nvrazda kennedy sa nikdy \"nevysetrila\" zatkla udajneho vraha, ktory vynu popieral a vsetky dokazy ktore verejnost poznala tak nenasvedocovali tomu, ze by mal byt vrah nejaky random obcan, ale ze to bolo skor spiknutie voci prezidentovy. Pachatelia vsak nikdy neboli oznaceny a dodnes existuju iba dohady. \n\npo vrazde kenedyho sa amerika zapojila do vojenskeho konfliktu vo vietname, ktorý trval viac ako 10 rokov, a americka verejnost mala k tejto invazii negativny postoj a napriek tomu sa ameriak do tejto vojny zapajala a zomierali tam americky vojaci v desaťtisicoch. \n\npo kennedyho smrti sa tsal prezidentom johnson, ktory dostal ameriku do vojny vo vietname, a snazil sa upokojit rozvratenu doveru obyvatelov v štát. po nom, v roku 1969 nastupil Nixon. \nNixon bol v urade do roku 1974, kedy musel predcasne odstupit z postu prezidenta po kauze \"water gate\", ktorá ho usvedcila z toho, ze nelegalnym sposobom vyuzival CIA na to aby upevnoval svoju moc a oslaboval ine urady, ktore by mohli vysetrovat tieto zlociny. konkretne bolo napatie medzi cia a FBI, kedy sa cia snazila zdiskreditovat alebo idealne zrusit FBI, a tak by sa mohla CIA stat dominantnou tajnou sluzbou v state. Water gate bola kauza, kde sa zistilo, ze CIA skutocne sledovala obcanov doma aj v zahranici, podnikala tajne operacie, viedal tajne financne fondy na financovanie MKultra a dalsich veci. Nixon, pred tym nez bol obvineny, tak nechal odvolat generalneho prokurator, aby sa tato kauza nemohla vysetrovat, avsak nixon prehral sudny spor, najdene tajne nahravky sa museli zeverjnit. Nixon sa tak musel vzdať funkcie, pretoze bol obvineny zo zneuzivania pravomoci verejneho cinitela. nasledujuci prezindet Ford, nixona oslobodil, ale napachene škody sa napravit uz nedali, pretoze plány na atentáty, atentát na Martina Luthera Kinga (černoch, čo povedal \"i have a dream\"), nelegalne odpocuvania domacich a zahranicnych obyvatelov a dalsie spinavosti, na ktore kennedy poukazoval, nixon v nich masivne pokracoval, čo ho nakoniec stálo prezidentsku stoličku a amerikca spolocnost je dodnes hlboko poznacena tymto obdobim rasizmu a nespravodlivosti", "context": "Esej písaná pre Lauru, demonštrácia schopnosti syntézy a objemu. Zameraná na vysvetlenie \"prečo\" a na systémové súvislosti.", "analysis": {"key_themes": ["Ekonomika ako hýbateľ", "Jednotlivec vs. Systém", "Moralita moci"], "archetypes": ["Objaviteľ", "Budovateľ", "Rebel (JFK)"], "style": "Total Immersion, Stream of Consciousness, Narrative Synthesis"}}
